fall2017/psyc3330/lectures/week6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Week 6 lecture notes - PSYC 3330</title>
<!-- 2017-10-05 Thu 07:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Week 6 lecture notes - PSYC 3330</h1>
<p>
Last week, we talked about the probability of finding a particular score (or set of scores) in the population.  This week we will discuss probabilities of <i>sample means</i>.  In particular, we are interested in answering questions like the following:
</p>

<ul class="org-ul">
<li>What is the probability of obtaining a sample mean greater than X?
</li>
</ul>

<p>
Also: 
</p>
<ul class="org-ul">
<li>with inferential statistics, we try to infer a population mean from a sample mean.  
</li>
<li>since this is just an estimate, there is a certain amount of <i>sampling error</i>
</li>
<li>how do we measure this sampling error?
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Distribution of sample means</h2>
<div class="outline-text-2" id="text-1">
<p>
To motivate the next definition, lets think about how we do research.  We take a sample, then we compute the mean.  How does our sample mean relate to the collection of <i>all possible sample means</i>? 
</p>

<p>
Definition: the <i>distribution of sample means</i> is the collection of sample means for all the possible random samples of a particular size \(n\) that can be obtained from a population.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Example:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In a small box, place a bunch of slips of paper, each of which is labeled with 2, 4, 6, or 8.  Have each member of the class randomly select two slips of paper and write down the numbers, then return the slips of paper in the box.
</p>

<p>
After everyone has recorded their "sample", ask each member of the class to compute the <i>sample mean</i>.  Write down the sample means on the board, then complete the probability distribution:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">\(\overline{X}\)</th>
<th scope="col" class="left">f</th>
<th scope="col" class="left">p</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">2</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
This is the <i>distribution of sample means</i>.  We can use it to ask questions like:
</p>

<ul class="org-ul">
<li>What is the probability of obtaining a sample mean of 7 or greater?
</li>
<li>What is the probability of obtaining a sample mean less than 3?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Computer simulation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The idea from our class activity can be visualized on a larger scale using a neat web applet:
</p>
<ul class="org-ul">
<li><a href="http://onlinestatbook.com/stat_sim/sampling_dist/">http://onlinestatbook.com/stat_sim/sampling_dist/</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Central Limit Theorem</h2>
<div class="outline-text-2" id="text-2">
<p>
From the applet demo in class, we can see the following properties of the distribution of sample means:
</p>
<ol class="org-ol">
<li>it is <b>normally distributed</b>
</li>
<li>its mean (denoted \(\mu_{\overline{x}}\)) is the same as the population mean \(\mu\)
</li>
<li>its standard deviation (denoted \(\sigma_{\overline{x}}\)) is equal to \(\displaystyle{\frac{\sigma}{\sqrt{n}}}\).  This is called the <b>standard error</b> 
</li>
</ol>

<p>
In fact, what this means is the following:  no matter what your population looks like (normally distributed or NOT), the distribution of sample means will be normally distributed with mean \(\mu\) and standard deviation \(\sigma/\sqrt{n}\).
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Some examples</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Example 1</b>: An instructor is interested in the IQ of her students.  She has 9 students in her class and thinks that they are, on average, really smart.  What is the probability that the group of students has a mean greater than or equal to 112?
</p>

<ul class="org-ul">
<li>We can use the standard normal table as in the last unit.  However, since this is a <i>sample</i>, we need to compute a \(z\) score on the <i>distribution of samples means</i>.  So we get:
</li>
</ul>

<p>
\[
z = \frac{\overline{x}-\mu}{\sigma_{\overline{x}}} = \frac{\overline{x}-\mu}{\sigma/\sqrt{n}} = \frac{112-100}{15/\sqrt{9}} = 2.4
\]
</p>

<p>
From the table, we compute \(P(z\geq 2.4) = 0.0082\)
</p>

<p>
<b>Example 2</b>. A random sample of \(n=9\) scores is obtained from a normal distribution with \(\mu=75\) and \(\sigma=6\).  What is the probability that the sample mean is greater than \(78\)?
</p>

<ul class="org-ul">
<li>As before, we compute the \(z\) score on the distribution of sample means:
</li>
</ul>

<p>
\[
z = \frac{\overline{x}-\mu}{\sigma_{\overline{x}}} = \frac{\overline{x}-\mu}{\sigma/\sqrt{n}} = \frac{78-75}{6/\sqrt{9}} = 1.5
\]
</p>

<p>
From the table, we compute \(P(z\geq 1.5) = 0.067\)
</p>


<p>
<b>Example 3</b>. A random sample of \(n=16\) scores is obtained from a normal distribution with \(\mu=50\) and \(\sigma=10\).  What is the probability that the sample mean will be between 48 and 52?
</p>

<ul class="org-ul">
<li>As before, we compute the \(z\) scores on the distribution of sample means:
</li>
</ul>

<p>
\[
z = \frac{\overline{x}-\mu}{\sigma_{\overline{x}}} = \frac{\overline{x}-\mu}{\sigma/\sqrt{n}} = \frac{48-50}{10/\sqrt{16}} = -0.8
\]
</p>

<p>
and 
</p>




<p>
<b>Example 4</b>. A researcher is interested in whether people can identify emotions in other people when they are extremely tired.  It is known that accuracy ratings of people in the general population are normally distributed with \(\mu=82\) and \(\sigma=7\).  The researcher arranges to test 50 people who had no sleep the previous night.  The mean accuracy for these 50 people was 80.  What is the probability of having a sample mean no larger than 80?
</p>

<ul class="org-ul">
<li>We compute the \(z\) score on the distribution of means:
</li>
</ul>

<p>
\[
z = \frac{\overline{x}-\mu}{\sigma_{\overline{x}}} = \frac{\overline{x}-\mu}{\sigma/\sqrt{n}} = \frac{80-82}{7/\sqrt{50}} = -2.02
\]
</p>

<p>
Thus, we compute \(P(z\leq -2.02)=0.022\)
</p>


<p>
<b>Example 5</b>. How high would a group of 25 have to score (on average) to be in the top 10% of IQ scores for groups of this size?
</p>

<ul class="org-ul">
<li>Recall that we can solve the \(z\)-score formula for \(\overline{x}\) to get:
</li>
</ul>

<p>
\[
\overline{x} = \mu + z \cdot \sigma_{\overline{x}} = \mu + z\cdot \frac{\sigma}{\sqrt{n}}
\]
</p>

<p>
Looking at the table, we see that \(z=1.28\) is required to be in top 10%.  So
</p>

<p>
\[
\overline{x} = \mu + z \cdot \sigma_{\overline{x}} = \mu + z\cdot \frac{\sigma}{\sqrt{n}} = 100 + 1.28 \frac{15}{\sqrt{25}} = 103.84
\]
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Oct 2-6, 2017</p>
<p class="date">Created: 2017-10-05 Thu 07:46</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
